#+title: articles title

* Deep Thought sdfsdf
I am **so** happy to be writing this.
** not so deep
sdf

*** oh well
I am **so** happy to be writing this.

#+begin_src python :exports both :results output
  print("& some code")
#+end_src

#+RESULTS:
: & some code

#+BEGIN_SRC emacs-lisp
  (defun org-xor (a b)
     "Exclusive or."
     (if a (not b) b))
#+END_SRC
